---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
OverrideGraphicSettings Constructor
OverrideGraphicSettings Class See Also Send Feedback
---

# Overload List

|  | Name | Description |
| --- | --- | --- |
|  | OverrideGraphicSettings()()()() | Creates a new instance of an OverrideGraphicSettings object. |
|  | OverrideGraphicSettings(OverrideGraphicSettings) | Creates a new instance of an OverrideGraphicSettings object based on an existing OverrideGraphicSettings object. |

# See Also

OverrideGraphicSettings Class

OverrideGraphicSettings Members

Autodesk.Revit.DB Namespace